{
  "greeting": "Hi, I'm",
  "projects": "My Projects",
  "services": "My Services",
  "about": "About",
  "contact": "Contact",
  "skills": "Skills",
  "experience&education": "Experience & Education",
  "Project Future": "Project Future",


  "welcome": "Welcome to my portfolio",
  "bio": "I am a Web Developer with over 6 months of experience in studying and working. My expertise includes creating and designing websites, working on both front-end and back-end, having experience in n8n automation workflows and much more...",

  "who": "WHO I AM",
  "portfolio": "Hello! I am a final year student majoring in Information Technology at Thuy Loi University, passionate about programming and web design.",
  "portfolioDescription": "With a strong desire to learn and high self-learning ability, I have completed many practical projects using ReactJS, Tailwind CSS, NodeJS and other modern technologies. My goal is to become a professional Web Developer, continuously improving my skills and contributing to products that bring practical value to the community. I am always ready to learn new things, challenge myself, and collaborate in creative and professional environments.",

  "what": "WHAT I DO",
  "serviceDescription": "I provide comprehensive web development services, including user interface design, back-end development, and workflow automation. My goal is to create effective and user-friendly web solutions that help your business grow stronger.",
  "webDesign": "Modern Website Design",
  "webDesignDescription": "Build user-friendly, aesthetic UIs with Tailwind CSS and ReactJS.",
  "frontEndDevelopment": "Web Applications Development",
  "frontEndDevelopmentDescription": "Create responsive and interactive web applications using ReactJS and modern front-end technologies.",
  "backEndDevelopment": "Back-End Development API",
  "backEndDevelopmentDescription": "Develop robust server-side applications and APIs using NodeJS and Express.",
  "automation": "Workflow Automation n8n",
  "automationDescription": "Implement automation solutions using n8n to streamline your business processes.",
  "responsiveDesign": "Responsive Design",
  "responsiveDesignDescription": "Ensure your website looks great on all devices with responsive design techniques.",
  "multiLanguage": "Multi-language & Theme Toggle",
  "multiLanguageDescription": "Support for bilingual interfaces (English/Vietnamese) and dark/light mode.",

  "work": "MY WORK",
  "projectDescription": "My projects are where I showcase my skills and creativity in web development. I have worked on various projects, from personal websites to complex web applications, using modern technologies to deliver the best user experience.",
  "all": "All",
  "html": "Html/CSS",
  "web": "ReactJS/NodeJS/Tailwind CSS",
  "javascript": "Javascript",
  "designProject1": "Design Project 1",

  "language": "Language",
  "library": "Library",
  "database": "Database",
  "tool": "Web Tool",
  "other": "Other Skills",

  "education": "Thuy Loi University",
  "educationDescription": "I am currently studying Information Technology at Thuy Loi University. I have a solid foundation in programming, data structures, databases, and computer networks.",
  "gpa": "GPA: 7.5/10.0",
  "gpaDescription": "Achieved Good - Excellent academic performance in multiple semesters, actively participating in research and personal projects.",
  "company": "NetBase JSC Solutions and Investments",
  "companyDescription": "Developed workflow automation processes for the company, including tasks such as sending emails, data management, and system integration, helping to increase work efficiency and reduce errors, using n8n and Javascript to implement automation solutions.",
  "portfolioWeb": "Portfolio Website – ReactJS + Tailwind CSS",
  "portfolioWebDescription": "Built a personal portfolio with responsive design, bilingual support, and dark/light mode. Designed a user-friendly UI, optimized basic SEO, and maintained a clear folder structure.",
  "socialWebsite": "SocialV - Facebook-like Social Platform",
  "socialWebsiteDescription": "A fullstack social network allowing users to post, create groups and events, send messages, interact in real-time, and receive instant notifications. The application features an admin system, JWT authentication, email verification, pagination, data filtering, and a statistics dashboard.",

  "newProject": "New Project",
  "projectfutureDescription": "My future projects will be where I continue to develop my skills and creativity in web development. I plan to work on new projects, apply advanced technologies, and improve user experience.",

  "touch": "Touch",
  "getinTouch": "Get in Touch",
  "getinTouchDescription": "If you have any questions or want to collaborate, feel free to contact me. I am always ready to discuss and work on exciting projects.",
  "home": "Home",
  "phone": "Phone",
  "name": "Name",
  "message": "Your Message Here...",
  "subject": "Subject",
  "send": "Send Message"
}
